---
title: "冒泡排序"
date: 2023-02-25T13:38:56+08:00
summary: "两两比较,大的往后推"
categories: ["Python"]
tags: [""]
---

#+begin_src python :results output
nums=[3,1,2,-1]
length=len(nums)

for i in range(length-1):
    swapped=False
    for j in range(length-1-i):
        if nums[j]>nums[j+1]:
            nums[j],nums[j+1]=nums[j+1],nums[j]
            swapped=True
    if not swapped:
        break
print(nums)
#+end_src

#+RESULTS:
: [-1, 1, 2, 3]
